Ran Plan for project: `my-infrastructure` dir: `diplom/main` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.hosts_templatefile will be created
+ resource "local_file" "hosts_templatefile" {
      + content              = <<-EOT
            [kube_control_plane]
            master1 ansible_host=192.168.1.11    ip=192.168.1.11  etcd_member_name=etcd1
            master2 ansible_host=192.168.2.22    ip=192.168.2.22  etcd_member_name=etcd2
            master3 ansible_host=192.168.3.33    ip=192.168.3.33  etcd_member_name=etcd3
            
            [etcd:children]
            kube_control_plane
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            calico_rr
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "/atlantis-data/repos/dreadsolnce/netology_courses/30/default/diplom/main/hosts.ini"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.bastion will be updated in-place
~ resource "yandex_compute_instance" "bastion" {
        id                        = "fhmk16ieq09un5ni37fu"
      ~ metadata                  = {
          ~ "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ["ALL=(ALL) NOPASSWD:ALL"]
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC+nKYEMsVkj5inclbxz5XQ0qPzZ+uWROHPnbQ1JpRoWRChFFQDJG3WtAqrUjQ2/4c7xAoKTwFcBaxJQWNPeqXK+zSQs7tDh57+XnvBJGkYa7lRYMgZXVq0VsHJIDHAqRHqZwnks9KQExObRffB+9xGgGRsV/AAaB9FmhLQ+bST1E87DHVZJOFstxQ6nfRgl/G47WKw8DAE0ODQwUDq07GOKteh8iLwrZkLL1DkbnfPeKeYcZxY4zmP3RJmU4EyK1iHfBuF50eHeGQ3+SC58U/TZM2L7HIGZRoKczB8+rdh3slfpS0zEmPhiqCCzb421RvRAQBiycrO/6OjjQgvgh6lMvFPHz/2xAeuX0DwBrqWfABbwkeZkPOuvfOhtz0Fh4T+O15Glxk/BN6M+zSZDwj/QJc19UAGsZfp910ZgBQI8N/PfwXOCwAimVSBOtyXTrW5AieSuxVTi0nVt/HwBnCoBV4Fmbv3DiZdCBQ56XYAyPj2MihN6agZe32Ss/ABe3M= kvl@VPS47612.ipserver.su
                
                package_update: true
                package_upgrade: false
                
                packages: ["htop","tmux","net-tools","mc","vim","nginx","ansible","git","python3-venv","libssl-dev","liblzma-dev","python3-tk","libsqlite3-dev","libreadline-dev","libffi-dev","libncurses5-dev","libncursesw5-dev","libbz2-dev","build-essential","gcc","python3-pip"]
                
                write_files:
                  # Копирование конфигурационного файла nginx (обратный прокси). Используем кодировку для передачи файла, т.к. даные содержат спец символы в виде :, а он корректно не передается
                  - path: /tmp/proxy
                    permissions: '0644'
                    encoding: b64
                    content: dXBzdHJlYW0gYmFja2VuZF9zZXJ2ZXJzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzEwMDAgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKIyBzZXJ2ZXIgMTI3LjAuMC4xOjgwODA7CiMgc2VydmVyIGJhY2t1cDEuZXhhbXBsZS5jb20gYmFja3VwOyAjINCg0LXQt9C10YDQstC90YvQuSDRgdC10YDQstC10YAKfQoKdXBzdHJlYW0gYmFja2VuZF9hcHAgewogICAgc2VydmVyIDE5Mi4xNjguMS4xMTozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMi4yMjozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwogICAgc2VydmVyIDE5Mi4xNjguMy4zMzozMTEwMCBtYXhfZmFpbHM9MSBmYWlsX3RpbWVvdXQ9MTBzOwp9Cgp1cHN0cmVhbSBiYWNrZW5kX2F0bGFudGlzIHsKICAgIHNlcnZlciAxOTIuMTY4LjEuMTE6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjIuMjI6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKICAgIHNlcnZlciAxOTIuMTY4LjMuMzM6MzAxNDEgbWF4X2ZhaWxzPTEgZmFpbF90aW1lb3V0PTEwczsKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGdyYWZhbmEua3ZscHJvLnNpdGU7CgogICAgbG9jYXRpb24gLyB7CiAgICAgICAgcHJveHlfcGFzcyBodHRwOi8vYmFja2VuZF9zZXJ2ZXJzOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQp9CnNlcnZlciB7CiAgICBsaXN0ZW4gODA7CiAgICBzZXJ2ZXJfbmFtZSBhbmltYWxzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXBwOwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgSG9zdCAkaG9zdDsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtUmVhbC1JUCAkcmVtb3RlX2FkZHI7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Gb3IgJHByb3h5X2FkZF94X2ZvcndhcmRlZF9mb3I7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBYLUZvcndhcmRlZC1Qcm90byAkc2NoZW1lOwogICAgfQoKfQoKc2VydmVyIHsKICAgIGxpc3RlbiA4MDsKICAgIHNlcnZlcl9uYW1lIGF0bGFudGlzLmt2bHByby5zaXRlOwoKICAgIGxvY2F0aW9uIC8gewogICAgICAgIHByb3h5X3Bhc3MgaHR0cDovL2JhY2tlbmRfYXRsYW50aXM7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBIb3N0ICRob3N0OwogICAgICAgIHByb3h5X3NldF9oZWFkZXIgWC1SZWFsLUlQICRyZW1vdGVfYWRkcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLUZvciAkcHJveHlfYWRkX3hfZm9yd2FyZGVkX2ZvcjsKICAgICAgICBwcm94eV9zZXRfaGVhZGVyIFgtRm9yd2FyZGVkLVByb3RvICRzY2hlbWU7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBVcGdyYWRlICRodHRwX3VwZ3JhZGU7CiAgICAgICAgcHJveHlfc2V0X2hlYWRlciBDb25uZWN0aW9uICJ1cGdyYWRlIjsKCiAgICB9Cgp9Cg==
                
                  # Файл с хостами для запуска плейбука установки кластера k8s
                  - path: /tmp/hosts.ini
                    permissions: '0644'
                    encoding: b64
                    content: W2t1YmVfY29udHJvbF9wbGFuZV0KbWFzdGVyMSBhbnNpYmxlX2hvc3Q9MTkyLjE2OC4xLjExICAgIGlwPTE5Mi4xNjguMS4xMSAgZXRjZF9tZW1iZXJfbmFtZT1ldGNkMQptYXN0ZXIyIGFuc2libGVfaG9zdD0xOTIuMTY4LjIuMjIgICAgaXA9MTkyLjE2OC4yLjIyICBldGNkX21lbWJlcl9uYW1lPWV0Y2QyCm1hc3RlcjMgYW5zaWJsZV9ob3N0PTE5Mi4xNjguMy4zMyAgICBpcD0xOTIuMTY4LjMuMzMgIGV0Y2RfbWVtYmVyX25hbWU9ZXRjZDMKCltldGNkOmNoaWxkcmVuXQprdWJlX2NvbnRyb2xfcGxhbmUKCltjYWxpY29fcnJdCgpbazhzX2NsdXN0ZXI6Y2hpbGRyZW5dCmt1YmVfY29udHJvbF9wbGFuZQpjYWxpY29fcnIK
                
                  # Приватный клюя для VM БАСТИОН
                  - path: /tmp/id_rsa
                    permissions: '0600'
                    encoding: b64
                    content: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKSndJQkFBS0NBZ0VBMU1xZjNGZENPWGtpemFXaFhINzRGdjh1TUVvNzkySFJpd3lNMGZoYVZHbk9vM2VrCk9zdkI1dE94eG91NE9IVzhKZXk3V3ExeGFXSS9LR2x3UFZ5OGFOeFFpSDQyL1N3K1lsQ0RNVmFMOFcyMGprWUUKN1lMV0NJbm1PWVhSS1NYSEtGVEt2VnhPUTFLcW5mNmJZRFlua2d5UnJQSlJuRG8xZDA1MDJBS2F0NTNnQXNSVwpyanZMSlpzTVdmekNqZGkyNy9KT25tOWRERC9vYWRtM29BVzgyQ1pkYTdxSlpCR0VTeU85WDFYZFlralhNT3Y0ClNuQkVVMllZN2Z4NUNEY3c4b3RuaGw2U09velIxc3o0Tk9NcTVtTnZzbWFKUzJwZ1ZCcVExQ1NVbms5SnlTVlgKQURkSVYvdFNtWmh5RzIwYWpoanBBZnlCSFNvWkRZV0hBNk9JaEVjWkhYRlptc25VeWhCbzRWNko1c1JjY1lWcgpZOEZoYUJOR2xxdU0yUXZTNTBvQmVIdStaT0RPc3BPTEF1ZWJCMi9ySm9yQlNYc3BpMEdtNHJaYWZPQWU3eDUxCndDNmQyajVEZThpOENzVlQ4WGNYdzkvYVJWOE1rdnY5N0pJcGs3L1dPMDIrcU0veG9qQnFRSFFzbUdJQlpJelQKeWg3RUIxYUJBbHZXQ2VHYmY5T3B0ckllbDZwbi9keXQ5NE5hWU94V2xoMzJ6bG1uYlZzZFIxWlJDNElGSmV5aApWMGQ4azNEOVdpWEIvUlFFZytyQlBqYSs4WXAyQ1BTUU1abEU2bkdJSXBjdHdKRjN5eFBBWGNqOXlYWWxpc1Z4CnNhd0lNbGV0a3FpSzlsMWZhTHlNSmxZbVVnTEJ2TUV3V2hNYzFmU0VxOHhvRDBtdWN2SkR3OGNVNzIwQ0F3RUEKQVFLQ0FnQlJid1BUcHA4azhJdFZxUXZDSXFNZDVlVk92TElMUDZlWjc2RWFuOUV0MmRvbks5dXhWcFhybU50QgpjT244elczR0U3MDFmQWZaZlN4UGNsNXVWVVdUV2JFR00wc25BMTRTY041c0xNTmNqdy9Zbk1vNC9PZWRGK3ovCjJZck1sUFVOSmJuNjBzN3VxNzI0dmgzSEthSm1IYUpJVGVuV2dGNUN2TWN4ZlhtcFNHVlltYnZVYlBTVy9TbXkKYkcwbUxLZ0Ixcmlvb0ZTN0lkLzNWa2NVR2U0RnlGVGJLK1YxWXRDK2tyeGZ0alFGYjN2TzhKY3lJWm04VXVlNgpkL0wzcG10NGZzb05IYmNYYWhuSit1SUlGMkd0RHFQSjRieXNIRmNtQ0k2aGFTaHBGMDNWQ1JHczl2c2NGSVd0Cld5NWIrWnArZytEMERpWjVPMG1nSjVnZVYrQ2ZrQktuU0N2ZXRMblM5OWtTVUo2VTJyZEFMWVRhdjYrZ0Z0VE4KVVFMWTZDT3JhSi9oOTZtV2VMQjBxNnlkWTRNWU5KZ0toS1dRTkNxclc1S0E3RUkvZ1laOXlBQll6NWhKZ3lLTQpOU3JnNkFETmMzc0NReFJ4Rk5Wd3FJNjU2OGJFVnFDVXdSNUZBRnJFOHg4THlOYm1nVDQzWDJ1VGIveGV6WFl1CjBZOUQwdjhFeXFRRFhZbFd5K2dwSWZoY1V4dElicGY4QXZ5cU1jTUFhNG00RFBYSEZqL2tYbXV5OUkvL1loa0gKYVhNNlBObmR2dHVVSnNqWVFaUUtZU0RSemJsdjJ0RFJsYjhXNktzaEp4UVFaTXJveGx2dW54bmZERWpxRnczKwo1NXp5d21MRnV3d3RKNi9EKzFCTVkxMTZOaS9rNW41VzRTZS9WcmZqT2huZVJRdS92d0tDQVFFQTZ1OFBIWWNKCnVSYWt4VU91UFlrQ3RnSGRob3E5VExINXo0UHdPSGRRa05hUWFScElhSS9JRjJaVHQvejJ4MldXcXRDOFNOa0kKandzTHhsVVNFR0M1Y1RyL0VIZFN2MU9VS21iaE1BMm1WWEtkandVS3k5Mk04dmZMRThvL1B0aWdZWk81V2xxYQpEU1Q5eTk3WlhOVDViYUtaVG02UG5RVFNoazkzK0lIZXE4ci9GL2dEZFFmejJmVGc0SkpDQmw3MzUzdE1xT3V4CmVoeVkvUzBNcjZITE1OVkJuVW1UWXAwbEl2RlRPMDJNYVpqRHJYVWh5eURoek04SVFOMjBndmM5VkgyNEVHTHQKVE1ZdndqTm1VbVFWTjRsZmM3M0JZWklpTWkwM2xlNUhqSmRNeE9pWEJqcElQWDhsSkJObXJuWXEzb0M3SjBRZwpwSjcwbUoxTXRZNENWd0tDQVFFQTU5OUkvQWpXMkhIc0E3TTRXUkUxQy9CU3JCellFODQ1QzQ1T2QwbXNDREMrCkIyQTZaM0pPQnBNZWs2NzhNa0FCL1hCZVFjM3BGN3hLTUJSQmdEWnRRd0tMdC9lQ1N5azJOTTlMbnlMbjc4M1cKYysvUk02UjlBTy9LVWpCVm5aT0gxazZFZkRUL0Yzcm55cVEwL1pwa2VLbWxrVndKMlVwVG10TmZMdy96V3FkVApDTUtPb3FXM0NYRU9XMHpPcmdRYk4yTktjcFRwanI3bzIzd1dHa2JwMTQ4ZzF4T2J2SXQ4NjZhdmRob3hHdWNHCnp5eWgwdXN6bERBZGwyMHhibkNIRlkxTzdQL241NDd6UVlpUUEvUzF6d0licVR2MlpLU1N1Z1pHRktQQXEyWFIKaDA5emNyZ05NR3EyNUUzYU0wWGcxb0VRd2J2K04xSkNTL0RzSCs4cDJ3S0NBUUF3K1pEdkdOMkFCaVpuTVFxNwpyVG94Y3dZWkxBYjJYQXUxcE0ySkYrWmxxelVEbEFVUU54a0JOOFd3RHozcXAxVFhXeGhGSDJsWFdIZ2w2a29QCnUvb3NqcDNwY3RaL0tBODFINmxGK1RKNWthRWkxV3hBdjNqSWxidHg3ckZzaW9BMGx6VUdqdWlhWU9HL2hEOVAKeU40T2F0MEdxcW1way8zSEhmM21nanhIRjlSQnpPUDdtNkxNQnU1eUlrczlSTUx0TUpqMGhkM0RsUDZYbUxLUwpVbW9uVGUyVnVtYk5JZkZCN1lqcVRlbzlnU2tabWRkbm52MHpVdDFubUZBdkZSZGw2NmRaVXlZZzRSZkhwaXRvCmRaQ3V1U1o2M0UzWjV6clZ0dk5sZi96T1pDUU8wR1hiV0g4Q3d1U2ROcVlyTEZzWGMwS1FsdlV2SEN2bFBMVm4KQzZtVkFvSUJBR0RnNCtlWjhkb2hUeEVFc29oVUxpdTh6MjNsNTBudklkcDRMTVNlWFdoV3BTOER2Nk0xR1BDYQpTMjQ4OEZZMmRCNWw4cHZmNG9IdVE3anUzYWNxRm1DbkVhVmRubXkwM1ZjWFBXdFI5RUkzYUdDc1ZHWVZWYjBzCmN3WC85K1dNbkhhbis2YkJwY3N6cU9ENzFzQVczOStpVWZEMzJZMldCblJyMkJzYnVQdXBhWUlCZUFMdzVoYmwKeTYvTjJaVFBWbWUvN24wTlJzQkRkNXNzcnpkdlpZaVEzcEcrT1pWL1drUkRNcEJQeFRDT1VrUUJTK09LTGRTKwpmYjZrK3NBLzk5RERaN1NSLzF5NlYxeU1LRS9lMEkrYk85OXJsRGpjb2dsalVhaVIrcEFpVEhjU2RSUDdYbGRhClh1dm9zMEEwOUFucmh3cks5eDQ2R2tVTWRqdXBlMzBDZ2dFQVczZGw3QW9ld1BVQS9sNy9Rdzd1amNQcUU4Z3MKRk83ZzhsWStsbHNqMndJY2JabEtlRXB3L296S1BVYzBJWkdMajdzODV5dTc0d2ZyRGxLZTdtODRKT2JodW1IMwp6MmRUZjZYOTd3bDkrdjBkMmhsVlc0SHFMdS8rL2JySUFuZGdCT1dnSU9YVnZXVmUrNitPNE5lb0lveHUxODBGCkwzV2YxaHdheGtqS3V3UlhsaFJXTlp5dldHdHFNMXVJZU1oY05MZWJwQ0V1OEJNeWMvTVAwTW81RHAxeDJmVkkKS3lxcHR4UjdlUmlQSFZxOGxyWWJmb1lhQlZab2lwMkgxd2dDYmRLY2pEd1Q3TVRKRmduTXQ2a25QbVkwMU5oOQpTSGlNV0lwdXZWT1BQZjBHZWkyT3pLWVpDQ1RSYWovWlBGbTJTY0JRZy9RWVZHRGlabUlIcFBNMkJ3PT0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
                
                  # Файл с настройками кластера
                  - path: /tmp/addons.yml
                    permissions: '0644'
                    encoding: b64
                    content: LS0tCiMgS3ViZXJuZXRlcyBkYXNoYm9hcmQKIyBSQkFDIHJlcXVpcmVkLiBzZWUgZG9jcy9nZXR0aW5nLXN0YXJ0ZWQubWQgZm9yIGFjY2VzcyBkZXRhaWxzLgojIGRhc2hib2FyZF9lbmFibGVkOiBmYWxzZQoKIyBIZWxtIGRlcGxveW1lbnQKaGVsbV9lbmFibGVkOiB0cnVlC
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.